{
    "title":"NISL - Executive Development Program",
    "course": [

        {
            "course": "course 1",
            "text": "it 1: i Educational Challenge",
            "state": 0,
            "master": {}
        },
        {
            "course": "course 1",
            "text": "it 2: i pal as gic Thinker",
            "state": 1,
            "master":[
                {
                    "title": "it Two • i pal as gic Thinker",
                    "contentRight": [
                        {
                            "title": "it at a Glance",
                            "text": "i first step in thinking gically is to stand i text. In it 1, pants were engaged in a deep analysis of i text iy found imselves in, as well as with an assessment of iir own strengths and weaknesses to deal with that situation. In addition, i pants will complete i Learning text Assessment in it 2, which explores text at a deeper level. With such an standing grounded in data and analysis, i pal can in collaboratively set forth a clear vision of ool improvement. Once i vision is agreed to and i gic intent is set, i pal, with i entire ool commity, is ready to begin i next step in gic thinking - namely, matching ways and means with ends. That entire process is i subject of this it.</br></br> pants will examine basic gic concepts, a process for thinking gically, and related frameworks and tools - all of which will assist pals to develop an action plan for improving student achievement. i pants will assess i differences among often - confused terms: ool vision, ool mission, and ool strategy. After reviewing a model of i gic thinking process, pants will study a number of ool visions to evaluate wheir or not iy fit i criteria for effective ool visions.</br></br> This it looks closely at gic thinking and i creation of strategies in i business and military texts, as well as in i education world. i rationale for looking outside i education world is to get pants to learn from oir enterprises that perform well - for i most part - with gic thinking, operational planning, and accountability in wing up on decisions and actions (tactics). Case studies in i military, business and education worlds will allow pants to adapt and apply iir knowledge to new situations.</br></br> In addition, i it examines decision-making processes that ool leaders need to stand and apply in analyzing complex situations, in overcoming barriers, and in ensuring i accomplishment of tives.</br></br> Effective strategy leads to decisions shared by stakeholders, as well as to i execution of measurable actions that get i desired results. Effective gic thinking culminates in accountable decisions and measurable actions. pants will apply iir knowledge in a review of several decisions made in NISL’s video and print case studies.</br></br> As a result of i two days on this it, pals should fully comprehend i need to think gically and to make action plans in connection with i subjects and goals of i next several its (particularly, standards-based instructional systems; i principles of teaching, learning and curriculum building; literacy; maimatics; science; and professional learning)."
                        },
                        {
                            "title": "Learning tives",
                            "text": "Upon completion of this it, i pants will know or be able to do i wing:",
                            "pharases": [
                                "stand and apply principles of gic thinking and strategy to ool texts",
                                "Create, value, and pursue gic vision to improve student achievement within standards-based ools",
                                "Lead and motivate a ool team to create a vision of where i ool wants to be over a period of years",
                                "Develop a strategy to implement that vision with approaches informed by analysis",
                                "Build action plans and milestones to execute i strategy",
                                "Examine decision-making processes that ool leaders need to stand and apply to ensure tives are accomplished",
                                "Apply a process for measuring i fulfillment of i strategy and vision",
                                "Apply leadership and decision-making concepts, as well as begin to exercise creative approaches to ool coherence and alignment- in order to achieve gic goals"
                            ]
                        },
                        {
                            "title": "note",
                            "text": "In ise opening its, pants will continue to cus on identifying i topics and approaches iy will take in iir Action Learning Projects. In i process of examining i ool/district text in which iy find imselves and in stand- ing i strengths and weaknesses of iir environment, pants will cus deeply on i project iy will undertake and complete within i EDP. i goal of i Action Learning Projects is to result in i higher achievement of students."
                        },
                        {
                            "title": "Key Questions",
                            "pharases": [
                                "What are i differences among i wing terms: ool/district vision, mission and strategy?",
                                "Why is it critical for ool leaders to get i vision right?",
                                "What are i differences among i terms gic thinking, operational planning, and tactics?",
                                "What examples of gic leadership and decision-making do you see in i case studies?",
                                "What are characteristic behaviors of a gic leader?",
                                "What is i relationship among gic thinking, decisions, and actions?",
                                "How do you link ise concepts in your own thinking and practice?",
                                "What process or framework should a ool leader use to think gically about his or her ool?",
                                "What criteria should a ool leader use in selecting a decision-making approach?"
                            ]
                        },
                        {
                            "title": "Materials Checklist"
                        },
                        {
                            "title": "Participant",
                            "pharases": [
                                "Participant’s Handbook",
                                "ool vision statements",
                                "it 2 Readings",
                                "Transformation at Ford” case study and/or “Success Story” [on i Cuban Missile Crisis] in Thinking in Time",
                                "A journal book for reflections and oir notes"
                            ]
                        },
                        {
                            "title":"Facilitator",
                            "pharases":[
                                "Instructor ’s Guide",
                                "PowerPoint presentation",
                                "Copies of i case studies: </br>- Harvard Business ool. “Transformation at Ford” </br>- Neustadt, R. and E.R. May. “Success Story.” Chap. 1 in Thinking in Time: i Uses of History for Decision Makers",
                                "Selected videos",
                                "“Law of i Harvest” (Covey) DVD (~ 7 minutes)",
                                "“Henry A. Wise Jr. Video Case” DVD (FROM it 1) (~ 35 minutes for full case)",
                                "Bob Hughes, “Analysis of i Cuban Missile Crisis” DVD (~ 15 minutes)",
                                "“Pasadena High ool Video Case” DVD",
                                "“Truman High ool Video Case” DVD",
                                "Case Study Reading Tool",
                                "Copies of i daily evaluation"
                            ]
                        },
                        {
                            "title":"Equipment",
                            "pharases":[
                                "Multi-media Projector with sound",
                                "DVD player",
                                "Flipchart with markers",
                                "Screen",
                                "Green and red dots",
                                "Napkins or envelopes"
                            ]
                        }
                    ]
                },
                {
                    "title":"it Two • Day One - Prework",
                    "titteLeft":"Lesson Guidelines",
                    "contentLeft":[
                        {
                            "title":"Computer Based",
                            "subtitle":"2 Hours",
                            "text":"For those facilitators who would like to use i Cuban Missile Crisis as a case study in class, please assign i Neustadt and May reading for Day 2. In that case, i facilitators may in wish to divide i class into two groups, each cused on one of i two case studies: i Cuban Missile Crisis or i Transformation at Ford. After discrete consideration of each case, please bring i groups back togeir to tease out i central ideas and present i applications to education.</br></br>In both cases, please use i conceptual framework for gic thinking as i basis for i analysis. What is most important is i application of i analysis to i world of education. We want i conceptual framework to become a way of thinking.</br></br>Facilitators should collect ool/district vision statements from pants as early as possible. Facilitators should review i statements in preparation for i mid-morning exercise."
                        }
                    ],
                    "contentRight":[
                        {
                            "title": "i purpose is:",
                            "pharases": [
                                "To stand and compare i terms “vision,” “mission,” and “strategy”",
                                "To differentiate between devising a strategy and simply planning ahead",
                                "To identify core elements of gic thinking and strategy",
                                "To construct and apply a framework for thinking gically"
                            ]
                        },
                        {
                            "title": "Required Readings",
                            "text": "All pants should read i wing materials for i first day of this it:",
                            "pharases": [
                                "Codding, Judy. 1999. “Does This ool REALLY Have A Vision?” Seattle, WA: Gates Foundation.",
                                "Neustadt, R. and E.R. May. “Success Story.” Chap. 1 in Thinking in Time: i Uses of History for Decision Makers"
                            ]
                        },
                        {
                            "title": "Additional Pre-work",
                            "pharases": [
                                "pants should complete i Learning text Assessment, which will directly impact valuable discussion on Day 1 of it 2.",
                                "pants should bring a copy of iir ool/district vision statement to class. If iy are not a current ool leader, iy should bring a copy of a vision statement of a ool/district for which iy are familiar. See Appendix A for sample vision statements. NISL is not presenting ise as model statements."
                            ]
                        },
                        {
                            "title": "Computer-Based Instruction",
                            "text": "pants should complete i Overview, gic Thinking and Strategy, and Case Preparation sections of i computer-based tutorial for it 2. i remaining online sections of it 2 will be completed prior to i second day of instruction."
                        },
                        {
                            "title": "Journal Activity",
                            "text": "pants will end i pre-work exercise with a journaling activity. pants should be ready to discuss iir journal entry in class on i first day of this it. </br></br>Facilitators should request that pants complete i wing components in iir journals:",
                            "pharases": [
                                "Write what iy take i terms ‘gic thinking’ and ‘strategy’ to mean.",
                                "Construct a framework for thinking about strategy. This framework can be a component/ element list, a model, a process drawing, or a descriptive paragraph.",
                                "Compare i new NISL conceptual framework with i framework iy have used in iir own ools/districts",
                                "Bring i framework iy have created to class i next day. ire will be an exercise cused on i frameworks."
                            ]
                        }
                    ]
                },
                {
                    "title": "it Introduction and Connections",
                    "titteLeft":"Lesson Guidelines",
                    "contentLeft":[
                        {
                            "subtitle":"5 Minutes"
                        }
                    ],
                    "contentRight": [
                        {
                            "text": "In i previous it, we cused on i urgency of improving instruction, leading to higher student achievement. pants completed i Instructional Leadership Instrument to assess iir own instructional leadership strengths and weaknesses.</br></br>In this it, pants will examine basic gic concepts, a process for thinking gically, and related frameworks and tools. In addition, pants will analyze a number of ool visions.</br></br>pants will also complete i Learning text Assessment to determine iir ool’s/ district’s current state. iy will use i results from this assessment, as well as from i Instructional Leadership Instrument, to select an Action Learning Project in i next it."
                        }
                    ]
                }

            ]
        },
        {
            "course": "course 1",
            "text": "it 3: Elements of Standards-Based Instructional Systems",
            "state": 0,
            "master": {}
        },
        {
            "course": "course 1",
            "text": "it 4: Foundations of Effective Learning",
            "state": 0,
            "master": {}
        },
        {
            "course": "course 2",
            "text": "it 5: Leadership for Excellence in Literacy",
            "state": 0,
            "master": {}
        },
        {
            "course": "course 2",
            "text": "it 6: Leadership for Excellence in Maimatics",
            "state": 0,
            "master": {}
        },
        {
            "course": "course 2",
            "text": "it 7: Leadership for Excellence in Science",
            "state": 0,
            "master": {}
        },
        {
            "course": "course 2",
            "text": "it 8: Promoting Professional Learning and Phase I Simulation",
            "state": 0,
            "master": {}
        },
        {
            "course": "course 3",
            "text": "it 9: i pal as Instructional Leader and Team Builder",
            "state": 0,
            "master": {}
        },
        {
            "course": "course 3",
            "text": "it 10: i pal as Ethical Leader",
            "state": 0,
            "master": {}
        },
        {
            "course": "course 3",
            "text": "it 11: i pal as Driver of Change",
            "state": 0,
            "master": {}
        },
        {
            "course": "course 3",
            "text": "it 12: Leading for Results",
            "state": 0,
            "master": {}
        }
    ]
}
